# train_data.py

TRAIN_DATA = [
    # Формат: ("Текст запроса", {"entities": [(старт, конец, "ТЕГ")]})
    
    ("Привет, посмотри пожалуйста передние колодки на калину", {
        "entities": [(28, 36, "SIDE"), (37, 44, "PRODUCT"), (48, 54, "CAR")]
    }),
    ("свистит ремень грм на приоре 16 кл", {
        "entities": [(8, 18, "PRODUCT"), (22, 28, "CAR")]
    }),
    ("нужна водяная помпа для весты", {
        "entities": [(6, 19, "PRODUCT"), (24, 29, "CAR")]
    }),
    ("здравствуйте, интересуют задние амортизаторы на уаз патриот", {
        "entities": [(25, 31, "SIDE"), (32, 44, "PRODUCT"), (48, 59, "CAR")]
    }),
    ("хотя нет, давай сначала задние колодки тормозные до кучи", {
        "entities": [(24, 30, "SIDE"), (31, 49, "PRODUCT")]
    }),
    ("ремень генератора на газель некст", {
        "entities": [(0, 17, "PRODUCT"), (21, 33, "CAR")]
    }),
    ("подскажи цену на стойки стабилизатора передние левые", {
        "entities": [(17, 37, "PRODUCT"), (38, 46, "SIDE"), (47, 52, "SIDE")]
    }),
    ("фильтр салона не угольный на ладу гранту", {
        "entities": [(0, 13, "PRODUCT"), (29, 40, "CAR")]
    }),
    ("почем выйдет масляный фильтр и свечи зажигания", {
        "entities": [(13, 28, "PRODUCT"), (31, 46, "PRODUCT")]
    }),
    ("нужны диски тормозные передние на шевроле ниву", {
        "entities": [(6, 21, "PRODUCT"), (22, 30, "SIDE"), (34, 47, "CAR")]
    }),
    ("яйца подвески на ваз 2114", {
        "entities": [(0, 13, "PRODUCT"), (17, 25, "CAR")]
    }),
    ("рулевой наконечник правый на солярис", {
        "entities": [(0, 18, "PRODUCT"), (19, 25, "SIDE")]
    }),
    ("подшипник ступицы задний правый", {
        "entities": [(0, 17, "PRODUCT"), (18, 24, "SIDE"), (25, 31, "SIDE")]
    }),
    ("трос ручника на логан", {
        "entities": [(0, 12, "PRODUCT")]
    }),
    ("косточки стабилизатора передние", {
        "entities": [(0, 22, "PRODUCT"), (23, 31, "SIDE")]
    })
]